# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Formulae
brew 'starship'
brew 'python'
brew 'coreutils'
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'htmltest'
brew 'node'
brew 'speedtest-cli'
brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'fig'

#Casks
cask 'alt-tab'
cask 'coconutbattery'
cask 'google-chrome'
cask 'raycast'
cask 'telegram-desktop'
cask 'spotify'
cask 'discord'
cask 'shottr'
cask 'betterdisplay'
cask 'github'
cask 'aldente'
cask 'iterm2'
cask 'appcleaner'
cask 'cyberduck'
cask 'handbrake'
cask 'firefox'
cask 'iina'
cask 'transmission'
cask 'keka'
cask 'macdown'
cask 'raindropio'
cask 'visual-studio-code'
cask 'teamviewer'
cask 'steam'
cask 'private-internet-access'

# Fonts
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-inter'
cask 'font-jetbrains-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro'

# Mac App Store Applications
mas 'Amphetamine', id: 937984704
mas 'Bitwarden', id: 1352778147
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Snippetslab', id: 1006087419
mas 'Velja', id: 1607635845
mas 'Dropover', id: 1355679052
mas 'Upnote', id: 1398373917
mas 'Pixelmator Pro', id: 1289583905
mas 'Hidden Bar', id: 1452453066
mas 'Paprika Recipe Manager', id: 1303222628
mas 'Magnet', id: 441258766
